lib/stripe_model_callbacks/fixtures/stripe_events/customer/customer.subscription.deleted.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "customer.subscription.deleted",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2020-03-02",
  "data": {
    "object": {
      "id": "sub_00000000000000",
      "object": "subscription",
      "application_fee_percent": null,
      "billing_cycle_anchor": 1518337183,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1518337183,
      "current_period_end": 1586593183,
      "current_period_start": 1583914783,
      "customer": "cus_00000000000000",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [
        {
          "id": "txr_00000000000000",
          "object": "tax_rate",
          "active": true,
          "created": 1524766962,
          "description": null,
          "display_name": "Tax",
          "inclusive": false,
          "jurisdiction": null,
          "livemode": false,
          "metadata": {
          },
          "percentage": 25
        }
      ],
      "discount": null,
      "ended_at": 1584469543,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_00000000000000",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1518337184,
            "metadata": {
            },
            "plan": {
              "id": "peak_00000000000000",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 6000,
              "amount_decimal": "6000",
              "billing_scheme": "per_unit",
              "created": 1518040777,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": "PeakFlow Build",
              "product": "prod_00000000000000",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "quantity": 10,
            "subscription": "sub_00000000000000",
            "tax_rates": [
            ]
          },
          {
            "id": "si_00000000000000",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1518337184,
            "metadata": {
            },
            "plan": {
              "id": "account_00000000000000",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 2000,
              "amount_decimal": "2000",
              "billing_scheme": "per_unit",
              "created": 1518040778,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": "Extra Docker build per month",
              "product": "prod_00000000000000",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "quantity": 3,
            "subscription": "sub_00000000000000",
            "tax_rates": [
            ]
          },
          {
            "id": "si_00000000000000",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1518337184,
            "metadata": {
            },
            "plan": {
              "id": "error_00000000000000",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 6000,
              "amount_decimal": "6000",
              "billing_scheme": "per_unit",
              "created": 1518040779,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": "Extra error reports",
              "product": "prod_00000000000000",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "quantity": 6,
            "subscription": "sub_00000000000000",
            "tax_rates": [
            ]
          },
          {
            "id": "si_00000000000000",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1518337184,
            "metadata": {
            },
            "plan": {
              "id": "translations_00000000000000",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 6000,
              "amount_decimal": "6000",
              "billing_scheme": "per_unit",
              "created": 1518040780,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": "Extra translations",
              "product": "prod_00000000000000",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "quantity": 0,
            "subscription": "sub_00000000000000",
            "tax_rates": [
            ]
          }
        ],
        "has_more": false,
        "url": "/v1/subscription_items?subscription=sub_CIrnjDvwypC43H"
      },
      "latest_invoice": "in_1GLPn6EKaFxLwikqY7dg5IOL",
      "livemode": false,
      "metadata": {
      },
      "next_pending_invoice_item_invoice": null,
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": null,
      "quantity": null,
      "schedule": null,
      "start_date": 1518337183,
      "status": "canceled",
      "tax_percent": 25,
      "trial_end": null,
      "trial_start": null
    }
  }
}